# Multi-table Datasets - ENRON Archive

## 1. Data import

Connect to the file 'assets/datasets/enron.db' using one of these methods:

- sqlite3 python package
- pandas.read_sql
- SQLite Manager Firefox extension

Take a look at the database and query the master table. How many Tables are there in the db?

In [29]:
import pandas as pd
import os
import sqlite3

os.getcwd()

'/Users/marthataylor/week03_classwork/starter-code'

In [30]:
#conn=sqlite3.connect('~/DSI-CHI-1/lessons/week-05/1.3-db-lab/assets/datasets/enron.db')
conn=sqlite3.connect('../enron.db')

#DSI-CHI-1/lessons/week-05/1.3-db-lab
#DSI-CHI-1/lessons/week-05/1.3-db-lab/assets/datasets/

In [31]:
c=conn.cursor()

In [26]:
os.listdir('.')

['.ipynb_checkpoints', 'enron.db', 'starter-code-1_3.ipynb']

Query the `sqlite_master` table to retrieve the schema of the `EmployeeBase` table.

1. What fields are there?
1. What's the type of each of them?

In [33]:
results_employee=c.execute('SELECT * FROM EmployeeBase LIMIT 10;')
results_employee.fetchall()

[(1,
  u'John Arnold',
  u'Forestry',
  u'ENA Gas Financial',
  u'VP Trading',
  u'Male',
  u'Senior'),
 (2,
  u'Harry Arora',
  u'Forestry',
  u'ENA East Power',
  u'VP Trading',
  u'Male',
  u'Senior'),
 (3,
  u'Robert Badeer',
  u'Forestry',
  u'ENA West Power',
  u'Mgr Trading',
  u'Male',
  u'Junior'),
 (4,
  u'Susan Bailey',
  u'Legal',
  u'ENA Legal',
  u'Specialist Legal',
  u'Female',
  u'Junior'),
 (5,
  u'Eric Bass',
  u'Forestry',
  u'ENA Gas Texas',
  u'Trader',
  u'Male',
  u'Junior'),
 (6,
  u'Don Baughman Jr.',
  u'Forestry',
  u'ENA East Power',
  u'Mgr Trading',
  u'Male',
  u'Junior'),
 (7,
  u'Sally Beck',
  u'Other',
  u'Energy Operations',
  u'VP',
  u'Female',
  u'Senior'),
 (8,
  u'Robert Benson',
  u'Forestry',
  u'ENA East Power',
  u'Dir Trading',
  u'Male',
  u'Senior'),
 (9, u'Lynn Blair', u'Other', u'ETS', u'Director', u'Female', u'Senior'),
 (10,
  u'Sandra F. Brawner',
  u'Forestry',
  u'ENA Gas East',
  u'Dir Trading',
  u'Female',
  u'Senior')]

In [34]:
results_employee=c.execute('SELECT * FROM MessageBase LIMIT 5;')
results_employee.fetchall()

[(1, u'taylor-m/sent/11', 910930020, u'Cd$ CME letter', 138),
 (2, u'taylor-m/sent/17', 911459940, u'Indemnification', 138),
 (3, u'taylor-m/sent/18', 911463840, u'Re: Indemnification', 138),
 (4, u'taylor-m/sent/23', 911874180, u'Re: Coral Energy, L.P.', 138),
 (5, u'taylor-m/sent/27', 912396120, u'Bankruptcy Code revisions', 138)]

In [35]:
results_employee=c.execute('SELECT * FROM RecipientBase LIMIT 5;')
results_employee.fetchall()

[(1, 1, 59), (2, 1, 15), (3, 1, 15), (4, 1, 109), (4, 2, 49)]

In [95]:
employees=pd.read_sql('SELECT * FROM EmployeeBase;', con=conn)
employees.head(3)

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior

In [39]:
message=pd.read_sql('SELECT * FROM MessageBase;', con=conn)
message.head(1)

   mid          filename  unix_time         subject  from_eid
0    1  taylor-m/sent/11  910930020  Cd$ CME letter       138

In [40]:
recipient=pd.read_sql('SELECT * FROM RecipientBase;', con=conn)
recipient.head(1)

   mid  rno  to_eid
0    1    1      59

1. Print the first 5 rows of EmployeeBase table
1. Print the first 5 rows of MessageBase table
1. Print the first 5 rows of RecipientBase table

**Hint**  use `SELECT` and `LIMIT`.

Import each of the 3 tables to a Pandas Dataframes

## 2. Data Exploration

Use the 3 dataframes to answer the following questions:

1. How many employees are there in the company?
- How many messages are there in the database?
- Convert the timestamp column in the messages. When was the oldest message sent? And the newest?
- Some messages are sent to more than one recipient. Group the messages by message_id and count the number of recepients. Then look at the distribution of recepient numbers.
    - How many messages have only one recepient?
    - How many messages have >= 5 recepients?
    - What's the highest number of recepients?
    - Who sent the message with the highest number of recepients?
- Plot the distribution of recepient numbers using Bokeh.

In [41]:
employees.shape

(156, 7)

In [42]:
employees.count()

eid               156
name              156
department        156
longdepartment    156
title             156
gender            156
seniority         156
dtype: int64

In [ ]:
#select count(*) from message

In [43]:
message.count()

mid          21635
filename     21635
unix_time    21635
subject      21635
from_eid     21635
dtype: int64

In [47]:
#number the seconds january 1 1970
message['datetime']=pd.to_datetime(message['unix_time'],unit='s')
#message['datetime']=pd.to_datetime(message['unix_time'])

In [48]:
message.head()

,mid,filename,unix_time,subject,from_eid,datetime
0,1,taylor-m/sent/11,910930020,Cd$ CME letter,138,1998-11-13 04:07:00
1,2,taylor-m/sent/17,911459940,Indemnification,138,1998-11-19 07:19:00
2,3,taylor-m/sent/18,911463840,Re: Indemnification,138,1998-11-19 08:24:00
3,4,taylor-m/sent/23,911874180,"Re: Coral Energy, L.P.",138,1998-11-24 02:23:00
4,5,taylor-m/sent/27,912396120,Bankruptcy Code revisions,138,1998-11-30 03:22:00

In [49]:
message.head().sort_values(by='datetime')

,mid,filename,unix_time,subject,from_eid,datetime
0,1,taylor-m/sent/11,910930020,Cd$ CME letter,138,1998-11-13 04:07:00
1,2,taylor-m/sent/17,911459940,Indemnification,138,1998-11-19 07:19:00
2,3,taylor-m/sent/18,911463840,Re: Indemnification,138,1998-11-19 08:24:00
3,4,taylor-m/sent/23,911874180,"Re: Coral Energy, L.P.",138,1998-11-24 02:23:00
4,5,taylor-m/sent/27,912396120,Bankruptcy Code revisions,138,1998-11-30 03:22:00

In [ ]:
message.head().sort_values(by='datetime')

In [51]:
message['datetime'].describe()

count                   21635
unique                  21309
top       1999-12-27 03:21:00
freq                        4
first     1998-11-13 04:07:00
last      2002-06-21 13:37:34
Name: datetime, dtype: object

In [54]:
message['datetime'].max(), message['datetime'].min()

(Timestamp('2002-06-21 13:37:34'), Timestamp('1998-11-13 04:07:00'))

In [55]:
#select * from messge limit 5
#select * from

In [56]:
recipient['mid'].value_counts()

12116    57
12151    57
12140    55
14404    52
16035    49
16431    24
8116     22
15577    21
15148    21
21103    20
21047    19
19671    18
10087    17
6495     17
19028    16
21628    16
12584    16
14194    16
18305    16
11492    16
14547    16
11516    16
14457    16
15584    15
13770    15
15121    15
15219    15
8970     15
15116    15
1355     15
         ..
2930      1
17243     1
21337     1
9047      1
11094     1
13141     1
15188     1
2898      1
4945      1
6992      1
17211     1
19258     1
21305     1
11062     1
17147     1
13109     1
15156     1
2866      1
4913      1
17179     1
19226     1
21273     1
11030     1
13077     1
15124     1
787       1
2834      1
4881      1
6928      1
2049      1
Name: mid, dtype: int64

In [66]:
import numpy as np
#recipient.pivot_table(index='rno',values='mid', aggfunc=len)  #didnt wo
#recipient.groupby

recipient.pivot_table(index='mid',values='rno', aggfunc=np.max)

mid
1         1
2         1
3         1
4         4
5         2
6         1
7         1
8         1
9         1
10        1
11        1
12        3
13        1
14        1
15        1
16        4
17        3
18        1
19        1
20        1
21        1
22        1
23        1
24        1
25        2
26        1
27        2
28       13
29        1
30        1
         ..
21606     1
21607     1
21608     1
21609     1
21610     1
21611     1
21612     1
21613     1
21614     1
21615     1
21616     1
21617     1
21618     1
21619     1
21620     1
21621     1
21622     1
21623     4
21624     4
21625     4
21626     5
21627     1
21628    16
21629     1
21630     1
21631     1
21632     1
21633     1
21634     5
21635     3
Name: rno, dtype: int64

In [ ]:
#recipient.groupby

In [68]:
recipient.pivot_table(index='mid',values='to_eid',aggfunc=len).value_counts()
#the number of emails one recp recieved

1     14985
2      2962
3      1435
4       873
5       711
6       180
7       176
8        61
13       57
11       47
12       33
10       29
15       28
9        24
14       11
16        9
21        2
17        2
57        2
22        1
52        1
20        1
55        1
19        1
24        1
18        1
49        1
Name: to_eid, dtype: int64

Selete mid, count(mid) from recipient  group by mid ORDER by count(mid) desc limit 10;

Rescale to investigate the tail of the curve

## 3. Data Merging

Use the pandas merge function to combine the information in the 3 dataframes to answer the following questions:

1. Are there more Men or Women employees?
- How is gender distributed across departments?
- Who is sending more emails? Men or Women?
- What's the average number of emails sent by each gender?
- Are there more Juniors or Seniors?
- Who is sending more emails? Juniors or Seniors?
- Which department is sending more emails? How does that relate with the number of employees in the department?
- Who are the top 3 senders of emails? (people who sent out the most emails)

In [102]:
print  [employees['gender']=='Male'].count()
print  [employees['gender']=='Female'].count()

TypeError: count() takes exactly one argument (0 given)

In [73]:
print message.shape
print employees.shape
print recipient.shape

(21635, 6)
(156, 7)
(38388, 3)

In [81]:
enron=pd.merge(recipient,message, on='mid')

In [76]:
enron.head(1)

,mid,rno,to_eid,filename,unix_time,subject,from_eid,datetime
0,1,1,59,taylor-m/sent/11,910930020,Cd$ CME letter,138,1998-11-13 04:07:00

In [85]:
enronTo=pd.merge(enron, employees, left_on='to_eid', right_on='eid')

In [86]:
enronTo.head(1)

,mid,rno,to_eid,filename,unix_time,subject,from_eid,datetime,eid_to,name_to,...,title_from,gender_from,seniority_from,eid,name,department,longdepartment,title,gender,seniority
0,1,1,59,taylor-m/sent/11,910930020,Cd$ CME letter,138,1998-11-13 04:07:00,59,Tana Jones,...,VP & Gen Cnsl,Male,Senior,59,Tana Jones,Legal,ENA Legal,Specialist Legal,Female,Junior

In [78]:
enron.head()

,mid,rno,to_eid,filename,unix_time,subject,from_eid,datetime,eid,name,department,longdepartment,title,gender,seniority
0,1,1,59,taylor-m/sent/11,910930020,Cd$ CME letter,138,1998-11-13 04:07:00,59,Tana Jones,Legal,ENA Legal,Specialist Legal,Female,Junior
1,4,4,59,taylor-m/sent/23,911874180,"Re: Coral Energy, L.P.",138,1998-11-24 02:23:00,59,Tana Jones,Legal,ENA Legal,Specialist Legal,Female,Junior
2,7,1,59,taylor-m/sent/33,912576240,Koch,138,1998-12-02 05:24:00,59,Tana Jones,Legal,ENA Legal,Specialist Legal,Female,Junior
3,8,1,59,taylor-m/sent/40,912685080,Re: Time to Celebrate!,138,1998-12-03 11:38:00,59,Tana Jones,Legal,ENA Legal,Specialist Legal,Female,Junior
4,10,1,59,taylor-m/sent/44,913166040,Re: Last Message,138,1998-12-09 01:14:00,59,Tana Jones,Legal,ENA Legal,Specialist Legal,Female,Junior

In [83]:
enron=pd.merge(enronTo, employees, left_on='from_eid', right_on='eid',suffixes=['_to','_from'])

In [84]:
enron.head()

,mid,rno,to_eid,filename,unix_time,subject,from_eid,datetime,eid_to,name_to,...,title_to,gender_to,seniority_to,eid_from,name_from,department_from,longdepartment_from,title_from,gender_from,seniority_from
0,1,1,59,taylor-m/sent/11,910930020,Cd$ CME letter,138,1998-11-13 04:07:00,59,Tana Jones,...,Specialist Legal,Female,Junior,138,Mark E. Taylor,Legal,ENA Legal,VP & Gen Cnsl,Male,Senior
1,4,4,59,taylor-m/sent/23,911874180,"Re: Coral Energy, L.P.",138,1998-11-24 02:23:00,59,Tana Jones,...,Specialist Legal,Female,Junior,138,Mark E. Taylor,Legal,ENA Legal,VP & Gen Cnsl,Male,Senior
2,7,1,59,taylor-m/sent/33,912576240,Koch,138,1998-12-02 05:24:00,59,Tana Jones,...,Specialist Legal,Female,Junior,138,Mark E. Taylor,Legal,ENA Legal,VP & Gen Cnsl,Male,Senior
3,8,1,59,taylor-m/sent/40,912685080,Re: Time to Celebrate!,138,1998-12-03 11:38:00,59,Tana Jones,...,Specialist Legal,Female,Junior,138,Mark E. Taylor,Legal,ENA Legal,VP & Gen Cnsl,Male,Senior
4,10,1,59,taylor-m/sent/44,913166040,Re: Last Message,138,1998-12-09 01:14:00,59,Tana Jones,...,Specialist Legal,Female,Junior,138,Mark E. Taylor,Legal,ENA Legal,VP & Gen Cnsl,Male,Senior

Answer the following questions regarding received messages:

- Who is receiving more emails? Men or Women?
- Who is receiving more emails? Juniors or Seniors?
- Which department is receiving more emails? How does that relate with the number of employees in the department?
- Who are the top 5 receivers of emails? (people who received the most emails)

Which employees sent the most 'mass' emails?

Keep exploring the dataset, which other questions would you ask?

Work in pairs. Give each other a challenge and try to solve it.